# Pandas

In [329]:
import numpy as np
import pandas as pd

## Series

In [330]:
labels = ['A','B','C']
my_list = [10,20,30]

In [331]:
pd.Series(my_list,index=labels)

A    10
B    20
C    30
dtype: int64

## Dataframes

### Creating a Df

In [332]:
data = {
    'Name' : ["Ayush","Riya","chaman"],
    'roll no' : [10,20,30],
    'Sex' : ['M','F','M']
}

In [333]:
df = pd.DataFrame(data)
df

     Name  roll no Sex
0   Ayush       10   M
1    Riya       20   F
2  chaman       30   M

In [334]:
data = [
    ["Ayush",10,"M"],
    ["Riya",20,"F"],
    ["chaman",30,'M']
]
columns = ['Name','Roll no','Sex']

In [335]:
df = pd.DataFrame(data,columns=columns)
df

     Name  Roll no Sex
0   Ayush       10   M
1    Riya       20   F
2  chaman       30   M

### Selection and Indexing of column

In [336]:
df['Name']

0     Ayush
1      Riya
2    chaman
Name: Name, dtype: object

In [337]:
df[["Name","Sex"]]

     Name Sex
0   Ayush   M
1    Riya   F
2  chaman   M

### Creating a new column

In [338]:
df["class"] = ['10th','6th','12th']
df

     Name  Roll no Sex class
0   Ayush       10   M  10th
1    Riya       20   F   6th
2  chaman       30   M  12th

In [339]:
df.drop('Sex',axis=1,inplace=True)
df.drop(0,axis=0,inplace=True)
df

     Name  Roll no class
1    Riya       20   6th
2  chaman       30  12th

### Selecting Row

In [340]:
df.iloc[1]

Name       chaman
Roll no        30
class        12th
Name: 2, dtype: object

### Selecting subset of Row and Column

In [341]:
data = {
    'Name' : ["Ayush","Riya","chaman"],
    'Roll no' : [10,20,30],
    'Sex' : ['M','F','M']
}

df = pd.DataFrame(data)

In [342]:
df.loc[[0,1]][["Name","Sex"]]

    Name Sex
0  Ayush   M
1   Riya   F

### Conditional selection

In [343]:
# return only Male students

df[df["Sex"] == "M"]

     Name  Roll no Sex
0   Ayush       10   M
2  chaman       30   M

### Missing data

In [344]:
data = {
    "A" : [1,2,np.nan,4,5],
    "B" : [1,np.nan,3,4,5],
    "C" : [1,2,3,np.nan,5],
    "D" : [1,2,3,4,np.nan],
    "E" : [1,2,3,4,5],
}

df = pd.DataFrame(data)

df

     A    B    C    D  E
0  1.0  1.0  1.0  1.0  1
1  2.0  NaN  2.0  2.0  2
2  NaN  3.0  3.0  3.0  3
3  4.0  4.0  NaN  4.0  4
4  5.0  5.0  5.0  NaN  5

In [345]:
df.isna()
df.isna().sum()         # Returns the sum of NaN's in a column

A    1
B    1
C    1
D    1
E    0
dtype: int64

### Removing Missing Data

In [346]:
df.dropna(thresh=3)   # thresh means that the row should have atleast 3 (given value) 'not null' value

     A    B    C    D  E
0  1.0  1.0  1.0  1.0  1
1  2.0  NaN  2.0  2.0  2
2  NaN  3.0  3.0  3.0  3
3  4.0  4.0  NaN  4.0  4
4  5.0  5.0  5.0  NaN  5

In [347]:
df.fillna(-1)    # Filling the null value with -1

     A    B    C    D  E
0  1.0  1.0  1.0  1.0  1
1  2.0 -1.0  2.0  2.0  2
2 -1.0  3.0  3.0  3.0  3
3  4.0  4.0 -1.0  4.0  4
4  5.0  5.0  5.0 -1.0  5

In [348]:
values = {"A":100,"B":200,"C":300,"D":400,"E":500}

df.fillna(value=values)

       A      B      C      D  E
0    1.0    1.0    1.0    1.0  1
1    2.0  200.0    2.0    2.0  2
2  100.0    3.0    3.0    3.0  3
3    4.0    4.0  300.0    4.0  4
4    5.0    5.0    5.0  400.0  5

In [349]:
df.fillna(df.mean())

     A     B     C    D  E
0  1.0  1.00  1.00  1.0  1
1  2.0  3.25  2.00  2.0  2
2  3.0  3.00  3.00  3.0  3
3  4.0  4.00  2.75  4.0  4
4  5.0  5.00  5.00  2.5  5

## Merging

In [350]:
employees = pd.DataFrame({
    'id': [101, 102, 103, 201, 202],
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'department': ['HR', 'Finance', 'IT', 'Marketing', 'Sales']
})


Salaries = pd.DataFrame({
    'id': [101, 102, 103, 303, 302],
    'salary': [50000, 75000, 60000, 85000, 95000],
    'bonus': [10000, 15000, 12000, 17000, 19000]
})

In [351]:
pd.merge(employees,Salaries)

    id     name department  salary  bonus
0  101    Alice         HR   50000  10000
1  102      Bob    Finance   75000  15000
2  103  Charlie         IT   60000  12000

In [352]:
pd.merge(employees,Salaries,on="id",how="outer") # <- means that merge both df on the basis of their id (default for how is 'inner')

    id     name department   salary    bonus
0  101    Alice         HR  50000.0  10000.0
1  102      Bob    Finance  75000.0  15000.0
2  103  Charlie         IT  60000.0  12000.0
3  201    David  Marketing      NaN      NaN
4  202     Emma      Sales      NaN      NaN
5  302      NaN        NaN  95000.0  19000.0
6  303      NaN        NaN  85000.0  17000.0

### Joining

In [353]:
df1 = pd.DataFrame(
    {
        "Name" : ["Ayush","Mohit","Riya"]
    }
)

df2 = pd.DataFrame(
    {
        'Sex' : ['M','M','F']
    }
)

In [354]:
df1.join(df2)

    Name Sex
0  Ayush   M
1  Mohit   M
2   Riya   F

### Group By aggregation

In [355]:
import pandas as pd

data = {
    'category': ['Electronics', 'Clothing', 'Groceries', 'Toys', 'Books'],
    'store': ['Store A', 'Store B', 'Store C', 'Store A', 'Store B'],
    'sales': [15000, 12000, 18000, 7000, 9000],
    'quantity': [10, 20, 30, 15, 12],
    'dates': ['2025-11-01', '2025-11-02', '2025-11-03', '2025-11-04', '2025-11-05']
}

df = pd.DataFrame(data)

In [356]:
new_df = df.groupby('category')['sales'].sum()

new_df

category
Books           9000
Clothing       12000
Electronics    15000
Groceries      18000
Toys            7000
Name: sales, dtype: int64

## Pivot Table

In [357]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    670     21   John  January      Q1
1  2023-01-02       B   West    197     67   Mary  January      Q1
2  2023-01-03       C  North    806     12    Bob  January      Q1
3  2023-01-04       D  South    358     10  Alice  January      Q1
4  2023-01-05       A   East    286     27   John  January      Q1
5  2023-01-06       B   West    500     98   Mary  January      Q1
6  2023-01-07       C  North    252     68    Bob  January      Q1
7  2023-01-08       D  South    943     59  Alice  January      Q1
8  2023-01-09       A   East    153     24   John  January      Q1
9  2023-01-10       B   West    572     18   Mary  January      Q1
10 2023-01-11       C  North    352     72    Bob  January      Q1
11 2023-01-12       D  South    275     80  Alice  January      Q1
12 2023-01-13       A   East    838     11   John  January      Q1
13 2023-01-14       B   West    695     74   Mary  January      Q1
14 2023-01-15       C  North    942     34    Bob  January      Q1
15 2023-01-16       D  South    620     74  Alice  January      Q1
16 2023-01-17       A   East    440     39   John  January      Q1
17 2023-01-18       B   West    392     45   Mary  January      Q1
18 2023-01-19       C  North    165     72    Bob  January      Q1
19 2023-01-20       D  South    688     40  Alice  January      Q1

In [358]:
pivot_df1 = pd.pivot_table(df,values="Sales",index="Product",columns="Region",aggfunc=['median'])

pivot_df1

        median
Region    East  North  South   West
Product
A        440.0    NaN    NaN    NaN
B          NaN    NaN    NaN  500.0
C          NaN  352.0    NaN    NaN
D          NaN    NaN  620.0    NaN

In [359]:
pivot_df2 = pd.pivot_table(df,values=['Sales','Units'],index='Region',columns='Product')

pivot_df2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     477.4    NaN    NaN    NaN  24.4   NaN   NaN   NaN
North      NaN    NaN  503.4    NaN   NaN   NaN  51.6   NaN
South      NaN    NaN    NaN  576.8   NaN   NaN   NaN  52.6
West       NaN  471.2    NaN    NaN   NaN  60.4   NaN   NaN

### Cross Tab

In [360]:
pd.crosstab(df['Region'],df["Units"])

Units   10  11  12  18  21  24  27  34  39  40  45  59  67  68  72  74  80  98
Region
East     0   1   0   0   1   1   1   0   1   0   0   0   0   0   0   0   0   0
North    0   0   1   0   0   0   0   1   0   0   0   0   0   1   2   0   0   0
South    1   0   0   0   0   0   0   0   0   1   0   1   0   0   0   1   1   0
West     0   0   0   1   0   0   0   0   0   0   1   0   1   0   0   1   0   1

## DataFrames Basic operations

In [361]:
df = pd.DataFrame({
    "A" : [i for i in range(1,6)],
    "B" : [i for i in range(10,51,10)],
    "C" : [i for i in range(100,501,100)],
})

df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [362]:
df.shape

(5, 3)

In [363]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [364]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [365]:
df.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [366]:
df['A'] + 11

0    12
1    13
2    14
3    15
4    16
Name: A, dtype: int64

## DataFrame applying function

In [367]:
def sqr(x):
    return x*x

In [368]:
df['A'].apply(sqr)

0     1
1     4
2     9
3    16
4    25
Name: A, dtype: int64

## Working with CSV

In [369]:
import os
df = pd.read_csv(os.path.join("data","anime.csv"))
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Rank    50 non-null     int64
 1   Title   50 non-null     object
 2   Score   50 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.3+ KB

### Feature extraction

In [370]:
def extract(txt,start_char,end_char,to_remove):
    txt = list(txt)
    ep = []
    st_index = -1
    en_index = -1
    st_char = start_char
    en_char = end_char
    remove_it = to_remove
    for idx, char in enumerate(txt):
        if char == st_char and st_index == -1:
            st_index = idx
        elif char == en_char:
            en_index = idx
            break

    count = st_index
    while count <= en_index:
        ep.append(txt[count])
        count += 1
    ep.pop()
    ep.remove(remove_it)
    return "".join(ep)

df["Episodes"] = df['Title'].apply(lambda x: extract(x,"(",")","("))
df['Episodes'] = df['Episodes'].str.replace("eps","")
df['Episodes'] = df['Episodes'].astype(str)
df

    Rank                                              Title  Score Episodes
0      1  Fullmetal Alchemist: BrotherhoodTV (64 eps)Apr...   9.10      64
1      2  Steins;GateTV (24 eps)Apr 2011 - Sep 20112,473...   9.07      24
2      3  Bleach: Sennen Kessen-henTV (13 eps)Oct 2022 -...   9.06      13
3      4  GintamaTV (51 eps)Apr 2015 - Mar 2016605,113 ...   9.06      51
4      5  Shingeki no Kyojin Season 3 Part 2TV (10 eps)A...   9.05      10
5      6  Gintama'TV (51 eps)Apr 2011 - Mar 2012534,105 ...   9.04      51
6      7  Gintama: The FinalMovie (1 eps)Jan 2021 - Jan ...   9.04       1
7      8  Hunter x Hunter TV (148 eps)Oct 2011 - Sep 201...   9.04     148
8      9  Kaguya-sama wa Kokurasetai: Ultra RomanticTV (...   9.04      13
9     10  Gintama': EnchousenTV (13 eps)Oct 2012 - Mar 2...   9.03      13
10    11  Shingeki no Kyojin: The Final Season - Kankets...   9.03       2
11    12  Ginga Eiyuu DensetsuOVA (110 eps)Jan 1988 - Ma...   9.02     110
12    13  Bleach: Sennen Kessen-hen - Ketsubetsu-tanTV (...   8.99      13
13    14  Fruits Basket: The FinalTV (13 eps)Apr 2021 - ...   8.99      13
14    15  Gintama.TV (12 eps)Jan 2017 - Mar 2017302,232 ...   8.98      12
15    16  GintamaTV (201 eps)Apr 2006 - Mar 20101,034,41...   8.94     201
16    17  Koe no KatachiMovie (1 eps)Sep 2016 - Sep 2016...   8.94       1
17    18  3-gatsu no Lion 2nd SeasonTV (22 eps)Oct 2017 ...   8.93      22
18    19  Clannad: After StoryTV (24 eps)Oct 2008 - Mar ...   8.93      24
19    20  Code Geass: Hangyaku no Lelouch R2TV (25 eps)A...   8.91      25
20    21  Gintama Movie 2: Kanketsu-hen - Yorozuya yo Ei...   8.91       1
21    22  Violet Evergarden MovieMovie (1 eps)Sep 2020 -...   8.89       1
22    23  Owarimonogatari 2nd SeasonTV (7 eps)Aug 2017 -...   8.88       7
23    24  Gintama.: Shirogane no Tamashii-hen - Kouhan-s...   8.88      14
24    25  MonsterTV (74 eps)Apr 2004 - Sep 20051,041,081...   8.87      74
25    26  Kimi no Na wa.Movie (1 eps)Aug 2016 - Aug 2016...   8.84       1
26    27  Kaguya-sama wa Kokurasetai: First Kiss wa Owar...   8.84       1
27    28  Bocchi the Rock!TV (12 eps)Oct 2022 - Dec 2022...   8.83      12
28    29  The First Slam DunkMovie (1 eps)Dec 2022 - Dec...   8.83       1
29    30  Vinland Saga Season 2TV (24 eps)Jan 2023 - Jun...   8.82      24
30    31  Jujutsu Kaisen 2nd SeasonTV (23 eps)Jul 2023 -...   8.82      23
31    32  Gintama.: Shirogane no Tamashii-henTV (12 eps)...   8.81      12
32    33  Kingdom 3rd SeasonTV (26 eps)Apr 2020 - Oct 20...   8.81      26
33    34  Mob Psycho 100 IITV (13 eps)Jan 2019 - Apr 201...   8.80      13
34    35  Shingeki no Kyojin: The Final SeasonTV (16 eps...   8.80      16
35    36  Kimetsu no Yaiba: Yuukaku-henTV (11 eps)Dec 20...   8.79      11
36    37  Kizumonogatari III: Reiketsu-henMovie (1 eps)J...   8.79       1
37    38  "Oshi no Ko"TV (11 eps)Apr 2023 - Jun 2023645,...   8.79      11
38    39  Haikyuu!! Karasuno Koukou vs. Shiratorizawa Ga...   8.78      10
39    40  Sen to Chihiro no KamikakushiMovie (1 eps)Jul ...   8.78       1
40    41  Monogatari Series: Second SeasonTV (26 eps)Jul...   8.77      26
41    42  Shingeki no Kyojin: The Final Season Part 2TV ...   8.77      12
42    43  Hajime no IppoTV (75 eps)Oct 2000 - Mar 200255...   8.76      75
43    44  Cowboy BebopTV (26 eps)Apr 1998 - Apr 19991,79...   8.75      26
44    45  Kingdom 4th SeasonTV (26 eps)Apr 2022 - Oct 20...   8.75      26
45    46  Vinland SagaTV (24 eps)Jul 2019 - Dec 20191,40...   8.74      24
46    47  Mushishi Zoku Shou 2nd SeasonTV (10 eps)Oct 20...   8.73      10
47    48  Shouwa Genroku Rakugo Shinjuu: Sukeroku Futata...   8.72      12
48    49  Mob Psycho 100 IIITV (12 eps)Oct 2022 - Dec 20...   8.71      12
49    50  Rurouni Kenshin: Meiji Kenkaku Romantan - Tsui...   8.71       4

In [371]:
def extract_exd(string):
    n_str = string.split()
    year = n_str[len(n_str)-1]
    n_year = year[0:4]
    string = string.replace(year,n_year)

    n_str = string.split()
    if n_str[len(n_str)-1].isdigit() and n_str[len(n_str)-2].isdigit():
        parts = string.split()
        last = parts[-1]

        if last.isdigit():
            parts = parts[:-1]
        string =  " ".join(parts)
    return string

df['Date'] = df['Title'].apply(lambda x: extract(x,")",",",")")).apply(extract_exd)
# df['Title'].iloc[30]
extract_exd('July 2023 - Aug 2023 556')
df

,Rank,Title,Score,Episodes,Date
0,1,Fullmetal Alchemist: BrotherhoodTV (64 eps)Apr...,9.10,64,Apr 2009 - Jul 2010
1,2,"Steins;GateTV (24 eps)Apr 2011 - Sep 20112,473...",9.07,24,Apr 2011 - Sep 2011
2,3,Bleach: Sennen Kessen-henTV (13 eps)Oct 2022 -...,9.06,13,Oct 2022 - Dec 2022
3,4,"GintamaTV (51 eps)Apr 2015 - Mar 2016605,113 ...",9.06,51,Apr 2015 - Mar 2016
4,5,Shingeki no Kyojin Season 3 Part 2TV (10 eps)A...,9.05,10,Apr 2019 - Jul 2019
5,6,"Gintama'TV (51 eps)Apr 2011 - Mar 2012534,105 ...",9.04,51,Apr 2011 - Mar 2012
6,7,Gintama: The FinalMovie (1 eps)Jan 2021 - Jan ...,9.04,1,Jan 2021 - Jan 2021
7,8,Hunter x Hunter TV (148 eps)Oct 2011 - Sep 201...,9.04,148,Oct 2011 - Sep 2014
8,9,Kaguya-sama wa Kokurasetai: Ultra RomanticTV (...,9.04,13,Apr 2022 - Jun 2022
9,10,Gintama': EnchousenTV (13 eps)Oct 2012 - Mar 2...,9.03,13,Oct 2012 - Mar 2013
10,11,Shingeki no Kyojin: The Final Season - Kankets...,9.03,2,Mar 2023 - May 2023
11,12,Ginga Eiyuu DensetsuOVA (110 eps)Jan 1988 - Ma...,9.02,110,Jan 1988 - Mar 1997
12,13,Bleach: Sennen Kessen-hen - Ketsubetsu-tanTV (...,8.99,13,Jul 2023 - Aug 2023
13,14,Fruits Basket: The FinalTV (13 eps)Apr 2021 - ...,8.99,13,Apr 2021 - Jun 2021
14,15,"Gintama.TV (12 eps)Jan 2017 - Mar 2017302,232 ...",8.98,12,Jan 2017 - Mar 2017
15,16,"GintamaTV (201 eps)Apr 2006 - Mar 20101,034,41...",8.94,201,Apr 2006 - Mar 2010
16,17,Koe no KatachiMovie (1 eps)Sep 2016 - Sep 2016...,8.94,1,Sep 2016 - Sep 2016
17,18,3-gatsu no Lion 2nd SeasonTV (22 eps)Oct 2017 ...,8.93,22,Oct 2017 - Mar 2018
18,19,Clannad: After StoryTV (24 eps)Oct 2008 - Mar ...,8.93,24,Oct 2008 - Mar 2009
19,20,Code Geass: Hangyaku no Lelouch R2TV (25 eps)A...,8.91,25,Apr 2008 - Sep 2008
20,21,Gintama Movie 2: Kanketsu-hen - Yorozuya yo Ei...,8.91,1,Jul 2013 - Jul 2013
21,22,Violet Evergarden MovieMovie (1 eps)Sep 2020 -...,8.89,1,Sep 2020 - Sep 2020
22,23,Owarimonogatari 2nd SeasonTV (7 eps)Aug 2017 -...,8.88,7,Aug 2017 - Aug 2017
23,24,Gintama.: Shirogane no Tamashii-hen - Kouhan-s...,8.88,14,Jul 2018 - Oct 2018
24,25,"MonsterTV (74 eps)Apr 2004 - Sep 20051,041,081...",8.87,74,Apr 2004 - Sep 2005
25,26,Kimi no Na wa.Movie (1 eps)Aug 2016 - Aug 2016...,8.84,1,Aug 2016 - Aug 2016
26,27,Kaguya-sama wa Kokurasetai: First Kiss wa Owar...,8.84,1,Dec 2022 - Dec 2022
27,28,Bocchi the Rock!TV (12 eps)Oct 2022 - Dec 2022...,8.83,12,Oct 2022 - Dec 2022
28,29,The First Slam DunkMovie (1 eps)Dec 2022 - Dec...,8.83,1,Dec 2022 - Dec 2022
29,30,Vinland Saga Season 2TV (24 eps)Jan 2023 - Jun...,8.82,24,Jan 2023 - Jun 2023
30,31,Jujutsu Kaisen 2nd SeasonTV (23 eps)Jul 2023 -...,8.82,23,Jul 2023 - Aug 2023
31,32,Gintama.: Shirogane no Tamashii-henTV (12 eps)...,8.81,12,Jan 2018 - Mar 2018
32,33,Kingdom 3rd SeasonTV (26 eps)Apr 2020 - Oct 20...,8.81,26,Apr 2020 - Oct 2021
33,34,Mob Psycho 100 IITV (13 eps)Jan 2019 - Apr 201...,8.80,13,Jan 2019 - Apr 2019
34,35,Shingeki no Kyojin: The Final SeasonTV (16 eps...,8.80,16,Dec 2020 - Mar 2021
35,36,Kimetsu no Yaiba: Yuukaku-henTV (11 eps)Dec 20...,8.79,11,Dec 2021 - Feb 2022
36,37,Kizumonogatari III: Reiketsu-henMovie (1 eps)J...,8.79,1,Jan 2017 - Jan 2017
37,38,"""Oshi no Ko""TV (11 eps)Apr 2023 - Jun 2023645,...",8.79,11,Apr 2023 - Jun 2023
38,39,Haikyuu!! Karasuno Koukou vs. Shiratorizawa Ga...,8.78,10,Oct 2016 - Dec 2016
39,40,Sen to Chihiro no KamikakushiMovie (1 eps)Jul ...,8.78,1,Jul 2001 - Jul 2001
40,41,Monogatari Series: Second SeasonTV (26 eps)Jul...,8.77,26,Jul 2013 - Dec 2013
41,42,Shingeki no Kyojin: The Final Season Part 2TV ...,8.77,12,Jan 2022 - Apr 2022
42,43,Hajime no IppoTV (75 eps)Oct 2000 - Mar 200255...,8.76,75,Oct 2000 - Mar 2002
43,44,"Cowboy BebopTV (26 eps)Apr 1998 - Apr 19991,79...",8.75,26,Apr 1998 - Apr 1999
44,45,Kingdom 4th SeasonTV (26 eps)Apr 2022 - Oct 20...,8.75,26,Apr 2022 - Oct 2022
45,46,"Vinland SagaTV (24 eps)Jul 2019 - Dec 20191,40...",8.74,24,Jul 2019 - Dec 2019
46,47,Mushishi Zoku Shou 2nd SeasonTV (10 eps)Oct 20...,8.73,10,Oct 2014 - Dec 2014
47,48,Shouwa Genroku Rakugo Shinjuu: Sukeroku Futata...,8.72,12,Jan 2017 - Mar 2017
48,49,Mob Psycho 100 IIITV (12 eps)Oct 2022 - Dec 20...,8.71,12,Oct 2022 - Dec 2022
49,50,Rurouni Kenshin: Meiji Kenkaku Romantan - Tsui...,8.71,4,Feb 1999 - Sep 1999

## Project

In [381]:
df = pd.read_csv(os.path.join('data','countries.csv'))
df.shape

(194, 64)

In [386]:
pd.set_option('display.max_columns', None)
df.head()

,country,country_long,currency,capital_city,region,continent,demonym,latitude,longitude,agricultural_land,forest_area,land_area,rural_land,urban_land,central_government_debt_pct_gdp,expense_pct_gdp,gdp,inflation,self_employed_pct,tax_revenue_pct_gdp,unemployment_pct,vulnerable_employment_pct,electricity_access_pct,alternative_nuclear_energy_pct,electricty_production_coal_pct,electricty_production_hydroelectric_pct,electricty_production_gas_pct,electricty_production_nuclear_pct,electricty_production_oil_pct,electricty_production_renewable_pct,energy_imports_pct,fossil_energy_consumption_pct,renewable_energy_consumption_pct,co2_emissions,methane_emissions,nitrous_oxide_emissions,greenhouse_other_emissions,urban_population_under_5m,health_expenditure_pct_gdp,health_expenditure_capita,hospital_beds,hiv_incidence,suicide_rate,armed_forces,internally_displaced_persons,military_expenditure_pct_gdp,birth_rate,death_rate,fertility_rate,internet_pct,life_expectancy,net_migration,population_female,population_male,population,women_parliament_seats_pct,rural_population,urban_population,press,democracy_score,democracy_type,median_age,political_leader,title
0,Afghanistan,Islamic State of Afghanistan,Afghan afghani,Kabul,Southern Asia,Asia,Afghan,33.0,65.0,383560.0,12084.4,652230.0,636173.000,3993.8400,NaN,39.2201,1.458310e+10,2.30237,84.3339,9.89845,11.710,82.6907,97.7000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,17.86,8709.470,16222.000,4863.39000,-1800.0000,0.00000,16.82610,81.3198,0.39,0.04,4.1,278000.0,4394000.0,1.35886,35.842,7.344,4.643,18.4000,62.0,-183672,20362329,20766442,41128771,27.01610,30181937,10946834,2.14,2.97,Authoritarian,12.9,Ashraf Ghani,President
1,Albania,Republic of Albania,Albanian lek,Tirana,Southern Europe,Europe,Albanian,41.0,20.0,11655.5,7889.0,27400.0,27331.600,827.6940,82.3836,24.5363,1.888210e+10,6.72520,53.0455,18.19860,11.808,50.0624,100.0000,24.548000,0.0,100.000000,0.0000,0.0,0.00000,0.000000,13.798,61.4218,44.58,4383.200,2692.200,1015.19000,11.6814,6.36726,6.65959,350.8350,2.89,0.03,4.3,8000.0,NaN,1.41564,10.240,11.325,1.390,79.3200,76.0,-10612,1391085,1384548,2775634,35.71430,1004807,1770827,2.62,5.98,Hybrid regime,33.7,Edi Rama,Prime Minister
2,Algeria,People's Democratic Republic of Algeria,Algerian dinar,Algiers,Northern Africa,Africa,Algerian,28.0,3.0,413588.0,19490.0,2381740.0,2305480.000,9357.1000,NaN,NaN,1.919130e+11,9.26552,30.5259,NaN,11.550,26.0712,99.7878,0.030106,0.0,0.210762,98.3575,0.0,1.31981,0.111922,-177.124,99.9779,0.15,161563.000,86543.900,12578.70000,-7720.5600,1.12475,6.32118,214.8520,1.90,0.04,2.5,317000.0,2500.0,5.59258,21.524,4.546,2.889,70.7700,76.0,-18797,22040987,22862237,44903225,8.10811,11328186,33575039,1.71,3.50,Authoritarian,24.0,Abdelmadjid Tebboune,President
3,Andorra,Principality of Andorra,Euro,Andorra la Vella,Southern Europe,Europe,Andorran,42.5,1.5,187.2,160.0,470.0,409.497,30.9358,NaN,NaN,3.352030e+09,NaN,NaN,NaN,NaN,NaN,100.0000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20.59,448.884,53.601,1.75881,NaN,0.00000,9.05176,3336.9200,2.50,NaN,NaN,NaN,NaN,NaN,7.000,3.900,1.270,93.8975,NaN,1377,39038,40786,79824,46.42860,9730,70094,3.17,0.00,Unknown,38.9,Xavier Espot Zamora,Head of Government
4,Angola,People's Republic of Angola,Angolan kwanza,Luanda,Middle Africa,Africa,Angolan,-12.5,18.5,569525.0,666074.0,1246700.0,1251000.000,2991.3500,NaN,16.6850,1.067140e+11,25.75430,65.8522,10.09040,10.209,61.3252,48.2239,2.548840,0.0,53.174900,0.0000,0.0,46.82510,0.000000,-540.997,48.3056,61.02,19814.500,32703.200,17757.90000,5203.0700,1.22031,2.91183,50.7426,0.80,0.52,6.1,117000.0,NaN,1.13206,38.809,8.009,5.304,32.6023,62.0,29089,17998220,17590767,35588987,33.63640,11359649,24229338,2.24,3.62,Authoritarian,12.4,Joo Loureno,President

In [397]:
# which country has the highest population
df[df['population'] == df['population'].max()]

,country,country_long,currency,capital_city,region,continent,demonym,latitude,longitude,agricultural_land,forest_area,land_area,rural_land,urban_land,central_government_debt_pct_gdp,expense_pct_gdp,gdp,inflation,self_employed_pct,tax_revenue_pct_gdp,unemployment_pct,vulnerable_employment_pct,electricity_access_pct,alternative_nuclear_energy_pct,electricty_production_coal_pct,electricty_production_hydroelectric_pct,electricty_production_gas_pct,electricty_production_nuclear_pct,electricty_production_oil_pct,electricty_production_renewable_pct,energy_imports_pct,fossil_energy_consumption_pct,renewable_energy_consumption_pct,co2_emissions,methane_emissions,nitrous_oxide_emissions,greenhouse_other_emissions,urban_population_under_5m,health_expenditure_pct_gdp,health_expenditure_capita,hospital_beds,hiv_incidence,suicide_rate,armed_forces,internally_displaced_persons,military_expenditure_pct_gdp,birth_rate,death_rate,fertility_rate,internet_pct,life_expectancy,net_migration,population_female,population_male,population,women_parliament_seats_pct,rural_population,urban_population,press,democracy_score,democracy_type,median_age,political_leader,title
75,India,Republic of India,Indian rupee,New Delhi,Southern Asia,Asia,Indian,20.0,77.0,1790450.0,721600.0,2973190.0,2956470.0,171839.0,46.5225,15.6631,3.385090e+12,6.69903,76.12,12.0174,7.33,73.8121,99.5725,2.66772,75.3094,9.98204,4.9232,2.79064,1.6595,5.36101,34.3055,73.577,35.82,2200840.0,697655.0,279004.0,-333368.0,1.44686,2.95919,56.6287,0.53,0.05,12.7,3045000.0,631000.0,2.65779,16.419,9.448,2.031,46.31,67.0,-301970,685992675,731180498,1417173173,14.9446,908804812,508368361,1.71,7.23,Flawed democracy,23.9,Narendra Modi,Prime Minister

In [ ]:
# what is the capital of the country with highest population
df[df['population'] == df['population'].max()]['capital_city']

75    New Delhi
Name: capital_city, dtype: object

In [403]:
# Which country has the least population
df[df['population'] == df['population'].min()]

,country,country_long,currency,capital_city,region,continent,demonym,latitude,longitude,agricultural_land,forest_area,land_area,rural_land,urban_land,central_government_debt_pct_gdp,expense_pct_gdp,gdp,inflation,self_employed_pct,tax_revenue_pct_gdp,unemployment_pct,vulnerable_employment_pct,electricity_access_pct,alternative_nuclear_energy_pct,electricty_production_coal_pct,electricty_production_hydroelectric_pct,electricty_production_gas_pct,electricty_production_nuclear_pct,electricty_production_oil_pct,electricty_production_renewable_pct,energy_imports_pct,fossil_energy_consumption_pct,renewable_energy_consumption_pct,co2_emissions,methane_emissions,nitrous_oxide_emissions,greenhouse_other_emissions,urban_population_under_5m,health_expenditure_pct_gdp,health_expenditure_capita,hospital_beds,hiv_incidence,suicide_rate,armed_forces,internally_displaced_persons,military_expenditure_pct_gdp,birth_rate,death_rate,fertility_rate,internet_pct,life_expectancy,net_migration,population_female,population_male,population,women_parliament_seats_pct,rural_population,urban_population,press,democracy_score,democracy_type,median_age,political_leader,title
179,Tuvalu,Tuvalu,Australian dollar,Funafuti,Polynesia,Oceania,Tuvaluan,-8.0,178.0,18.0,10.0,30.0,39.0978,0.0,NaN,NaN,60349400.0,0.500581,NaN,NaN,NaN,NaN,99.6824,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6.68,6.6,11.5745,1.44319,9.38116,0.0,21.5392,1071.31,5.6,NaN,NaN,NaN,NaN,NaN,23.484,10.159,3.163,71.5866,65.0,-15,5513,5799,11312,6.25,3900,7412,0.0,0.0,Unknown,21.0,Kausea Natano,Prime Minister

In [404]:
# what is the capital of the country with least population
df[df['population'] == df['population'].min()]['capital_city']

179    Funafuti
Name: capital_city, dtype: object

In [410]:
#give me top 5 countries with highest democratic score

df.sort_values(by='democracy_score',ascending=False,inplace=False).head()

,country,country_long,currency,capital_city,region,continent,demonym,latitude,longitude,agricultural_land,forest_area,land_area,rural_land,urban_land,central_government_debt_pct_gdp,expense_pct_gdp,gdp,inflation,self_employed_pct,tax_revenue_pct_gdp,unemployment_pct,vulnerable_employment_pct,electricity_access_pct,alternative_nuclear_energy_pct,electricty_production_coal_pct,electricty_production_hydroelectric_pct,electricty_production_gas_pct,electricty_production_nuclear_pct,electricty_production_oil_pct,electricty_production_renewable_pct,energy_imports_pct,fossil_energy_consumption_pct,renewable_energy_consumption_pct,co2_emissions,methane_emissions,nitrous_oxide_emissions,greenhouse_other_emissions,urban_population_under_5m,health_expenditure_pct_gdp,health_expenditure_capita,hospital_beds,hiv_incidence,suicide_rate,armed_forces,internally_displaced_persons,military_expenditure_pct_gdp,birth_rate,death_rate,fertility_rate,internet_pct,life_expectancy,net_migration,population_female,population_male,population,women_parliament_seats_pct,rural_population,urban_population,press,democracy_score,democracy_type,median_age,political_leader,title
127,Norway,Kingdom of Norway,Norwegian krone,Oslo,Northern Europe,Europe,Norwegian,62.0,10.0,9859.62,121800.0,364285.0,306188.0,2007.78,30.7520,37.5408,5.792670e+11,5.76412,4.49490,25.7469,3.171,3.64231,100.0,31.3179,0.104918,95.825500,1.805140,0.0000,0.020150,1.88435,-581.3470,56.9516,61.29,36177.4,4342.760,3522.990,-3686.010,2.89411,10.08630,9020.63,3.53,0.01,11.8,23000.0,NaN,1.84136,10.40,7.80,1.55,99.0000,83.0,10604,2703524,2753603,5457127,44.9704,891476,4565651,10.00,9.87,Full democracy,35.6,Erna Solberg,Prime Minister
74,Iceland,Republic of Iceland,Iceland krona,Reykjavk,Northern Europe,Europe,Icelander,65.0,-18.0,18720.00,513.5,100830.0,88792.0,107.56,96.8655,35.0853,2.784160e+10,8.30875,12.53120,21.6184,3.809,8.32042,100.0,37.5169,0.000000,73.307100,0.000000,0.0000,0.021278,26.67160,11.5576,11.2889,82.79,1446.6,515.165,368.659,-1573.880,6.32113,9.65297,6636.00,2.83,0.03,11.9,0.0,NaN,NaN,13.10,6.30,1.82,99.6870,83.0,622,186151,195748,381900,47.6190,22945,358955,5.32,9.58,Full democracy,32.1,Katrn Jakobsdttir,Prime Minister
164,Sweden,Kingdom of Sweden,Swedish krona,Stockholm,Northern Europe,Europe,Swedish,62.0,15.0,30055.40,279800.0,407284.0,411134.0,4064.23,40.6607,32.9924,5.859390e+11,8.36929,10.52690,27.3368,7.358,7.03763,100.0,43.2411,0.666951,46.508700,0.262457,34.7364,0.155622,16.75400,24.6521,25.1171,58.40,33576.1,4792.090,6381.070,-4904.420,3.39593,11.27990,6914.91,2.14,NaN,14.7,15000.0,NaN,1.27685,11.00,8.80,1.67,88.3078,83.0,80097,5201777,5285164,10486941,46.4183,1206837,9280104,9.41,9.39,Full democracy,35.6,Stefan Lfven,Prime Minister
122,New Zealand,New Zealand,New Zealand dollar,Wellington,Australia and New Zealand,Oceania,New Zealander,-41.0,174.0,101540.00,98925.9,263310.0,270549.0,1970.29,50.9863,33.3996,2.472340e+11,7.17222,20.00330,28.8432,3.253,13.57180,100.0,13.9876,4.252910,55.502800,15.534400,0.0000,0.002262,24.57870,19.4782,59.7492,28.61,31359.7,32241.900,14909.900,-646.202,2.22378,10.02860,4201.63,2.57,0.02,11.0,9000.0,NaN,1.37098,11.48,6.83,1.64,95.9102,82.0,38220,2584111,2539990,5124100,50.4202,672077,4452023,7.27,9.26,Full democracy,32.8,Jacinda Ardern,Prime Minister
46,Denmark,Kingdom of Denmark,Danish krone,Copenhagen,Northern Europe,Europe,Danish,56.0,10.0,26199.90,6284.4,40000.0,40365.6,2235.49,75.2616,37.8099,3.954040e+11,7.69657,8.93649,35.4556,4.172,5.26052,100.0,11.7489,24.544900,0.062183,6.273530,0.0000,1.081290,65.44370,1.7750,64.9271,39.70,27356.5,7778.770,5492.830,-1927.650,8.64749,10.84630,7375.15,2.60,0.02,10.7,15000.0,NaN,1.37159,10.80,9.80,1.72,98.8659,81.0,22746,2966194,2936844,5903037,43.5754,686700,5216337,7.92,9.22,Full democracy,37.2,Mette Frederiksen,Prime Minister